tap "homebrew/bundle"
# User-friendly launcher for Bazel
brew "bazelisk"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# General purpose Language Server
brew "efm-langserver"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Remote repository management made easy
brew "ghq"
# Git extension for versioning large files
brew "git-lfs"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Simple terminal UI for git commands
brew "lazygit"
# Next-gen compiler infrastructure
brew "llvm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Shell command parallelization utility
brew "parallel"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Clipboard extension app
cask "clipy"
# Keyboard customiser
cask "karabiner-elements"
# Neovim Client
cask "neovide"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Open-source code editor
cask "visual-studio-code"
