tap "argoproj/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "microsoft/git"
tap "treasure-data/tap"
# User-friendly launcher for Bazel
brew "bazelisk"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# General purpose Language Server
brew "efm-langserver"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# General-purpose data compression with high compression ratio
brew "xz"
# Remote repository management made easy
brew "ghq"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Simple terminal UI for git commands
brew "lazygit"
# Emulator for x86 and PowerPC
brew "qemu"
# Linux virtual machines
brew "lima"
# Next-gen compiler infrastructure
brew "llvm"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Implementation of the Language Server Protocol for LaTeX
brew "texlab"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Kubectl Argo Rollouts Plugin.
brew "argoproj/tap/kubectl-argo-rollouts"
brew "treasure-data/tap/td-security"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Clipboard extension app
cask "clipy"
# Keyboard customizer
cask "karabiner-elements"
# Neovim Client
cask "neovide"
# Open-source code editor
cask "visual-studio-code"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
