tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# User-friendly launcher for Bazel
brew "bazelisk"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Platform built on V8 to build network applications
brew "node"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Code-search similar to ack
brew "the_silver_searcher"
# Internet file retriever
brew "wget"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# NCurses Disk Usage
brew "ncdu"
# Cross-platform ncurses Spotify client written in Rust
brew "ncspot"
# Terminal-based client for Spotify
brew "spotify-tui"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Next-gen compiler infrastructure
brew "llvm"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Tool to build, change, and version infrastructure
brew "terraform"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Programmatically correct mistyped console commands
brew "thefuck"
# Provides session management: i.e. separate programs from terminals
brew "abduco"
cask "alt-tab"
cask "clipy"
cask "slack"
# Todoist CLI client
brew "sachaos/todoist/todoist", args: ["HEAD"]
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk9"
# Application uninstaller
cask "appcleaner"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Menu bar application that lists iCloud Tabs
cask "cloudytabs"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
# Keyboard customizer
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Music streaming service
cask "spotify"
# Time tracker
cask "toggl-track"
# Configurable document editor that supports Markdown
cask "typora"
# GUI for the Neovim text editor
cask "vimr"
