tap "argoproj/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
tap "microsoft/git"
# User-friendly launcher for Bazel
brew "bazelisk"
# Connect and disconnect Bluetooth devices
brew "bluetoothconnector"
# General-purpose data compression with high compression ratio
brew "xz"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU awk utility
brew "gawk"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Remote repository management made easy
brew "ghq"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Simple terminal UI for git commands
brew "lazygit"
# Linux virtual machines
brew "lima"
# Next-gen compiler infrastructure
brew "llvm"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Shell command parallelization utility
brew "parallel"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Editor of encrypted files
brew "sops"
# Version control system designed to be a better CVS
brew "subversion"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Implementation of the Language Server Protocol for LaTeX
brew "texlab"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Command-line fuzzy finder written in Go
brew "fzf"
# Kubectl Argo Rollouts Plugin.
brew "argoproj/tap/kubectl-argo-rollouts"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Clipboard extension app
cask "clipy"
# Menu bar application that lists iCloud Tabs
cask "cloudytabs"
# Web browser
cask "google-chrome"
cask "git-credential-manager-core"
# Keyboard customizer
cask "karabiner-elements"
# Neovim Client
cask "neovide"
# Music streaming service
cask "spotify"
# Configurable document editor that supports Markdown
cask "typora"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source code editor
cask "visual-studio-code"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
